/* Дана сторона квадрата. Найдите его периметр.*/

System.Console.WriteLine("Введите число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
int p = num1*4;
System.Console.WriteLine($"Периметр квадрата равен: {p} ");