//Вывести на экран два числа от пользователя одно под другим.

System.Console.WriteLine("Введите два числа: ");
int num1 = Convert.ToInt32(Console.ReadLine());
int num2 = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"Число 1: {num1} \nЧисло 2: {num2}");
