//Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

/*System.Console.WriteLine("Введите длину ребра куба: ");
int num = Convert.ToInt32(Console.ReadLine());
int v = Math.Pow(num, 3) + "куб.см");
int s = Math.Pow(num, 2) * 6 + "кв.см");
System.Console.WriteLine($"Объем куба: {v} ");*/