// int num = Convert.ToInt32(Console.ReadLine());
// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное само на себя);

/*Console.WriteLine("Введите число ");
string strNum = Console.ReadLine();
int num = int.Parse(strNum);
int sqr = num * num;
Console.WriteLine(sqr);*/

/*Console.WriteLine("Введите число ");
int num = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(num * num);*/

