/*Дан радиус окружности. Найти ее диаметр.*/

System.Console.WriteLine("Введите число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
//num1 = num1*2;
int d = num1*2;
System.Console.WriteLine($"Диаметр окружности: {d} ");